app/controllers/rides_controller.rb

  def update
    @jw = Ride.find(params[:ride_id])
    if (params[:top])
      @jw[:top] = true
    else
      @jw[:top] = false
    end
    session[:last] = @jw[:floor]
    @jw[:timetoclick] = (Time.now - @jw[:created_at])
    session[:timecount] += @jw[:timetoclick]
    session[:ridecount] += 1
    session[:floorcount] += @jw[:floor]
    @sesh = Usersession.find(session[:seshid])
    @sesh[:ridecount] = session[:ridecount]
    @sesh[:time] = session[:timecount]
    @sesh[:floors] = session[:floorcount]
    @sesh[:config] = session[:config]
    @sesh.save
    @jw.save
---
SELECT "rides".* FROM "rides" WHERE "rides"."id" = $1 LIMIT 1  [["id", "update"]]
SELECT "usersessions".* FROM "usersessions" WHERE "usersessions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "usersessions" SET "ridecount" = 1, "time" = 5.209829, "updated_at" = '2012-02-03 03:09:13.125270', "config" = 2, "floors" = 16 WHERE "usersessions"."id" = 61
UPDATE "rides" SET "updated_at" = '2012-01-29 19:12:10.083663', "timetoclick" = 1.444118, "top" = 'f' WHERE "rides"."id" = 400

  def show

    @i = 4
    @j = 5

    @lobbyweight = 1 + rand(100)
    if @lobbyweight > 25 || session[:last] == 1
      @floor = 1 + rand(@i*@j)
      while (@floor == session[:last])
        @floor = 1 + rand(@i*@j)
      end
    else
      @floor = 1
    end
    if !session[:seshid]
      @usersesh = Usersession.new
      @usersesh.save
---
INSERT INTO "usersessions" ("config", "created_at", "floors", "name", "rides", "time", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["config", nil], ["created_at", Sun, 29 Jan 2012 23:41:37 UTC +00:00], ["floors", nil], ["name", nil], ["rides", nil], ["time", nil], ["updated_at", Sun, 29 Jan 2012 23:41:37 UTC +00:00]]

    @ride[:columns] = @j
    @ride[:floor] = @floor
    @ride[:ip_address] = request.remote_ip
    @ride.save
---
INSERT INTO "rides" ("columns", "config", "created_at", "floor", "ip_address", "last", "rows", "session_id", "timetoclick", "top", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def nameentry

    if params[:name] != "" && isclean(params[:name].downcase)
      if !session[:seshid]
        @usersesh = Usersession.new
        @usersesh.save
        session[:seshid] = @usersesh[:id]
      end
      @jw = Usersession.find(session[:seshid])
      @jw[:name] = params[:name]
      session[:name] = @jw[:name]
      @jw.save
---
INSERT INTO "usersessions" ("config", "created_at", "floors", "name", "rides", "time", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["config", nil], ["created_at", Sun, 29 Jan 2012 23:50:47 UTC +00:00], ["floors", nil], ["name", nil], ["rides", nil], ["time", nil], ["updated_at", Sun, 29 Jan 2012 23:50:47 UTC +00:00]]
SELECT "usersessions".* FROM "usersessions" WHERE "usersessions"."id" = $1 LIMIT 1  [["id", 19]]
UPDATE "usersessions" SET "updated_at" = '2012-01-30 00:07:41.350684', "name" = 'Josh' WHERE "usersessions"."id" = 31

  def leaders

  @leaders = Usersession.find(:all, :conditions => "ridecount >= 0", :order => "ridecount desc, floors desc", :limit => 25)
---
SELECT "usersessions".* FROM "usersessions" WHERE (ridecount >= 0) ORDER BY ridecount desc, floors desc LIMIT 25

  def results

    #filtering out times > 10s
    @Atype = "All"
    @UStype = "Unskilled: <21"
    @Stype = "Skilled: 21-49"
    @Ptype = "Power: 50-99"
    @Ctype = "Cents: 100-499"
    @Ttype = "Tricks: 500+"

    @buckets = ['A', 'US', 'S', 'P', 'C', 'T']



    #all lobbies

    @A0count = Usersession.config0.count
    @A0 = Usersession.config0.collect {|u| u.rides}.flatten
    @Alobby0 = @A0.select{|u| u[:floor] == 1}.count
---
SELECT COUNT(*) FROM "usersessions"
SELECT "rides".* FROM "rides" WHERE (top IS NOT NULL and config = 0 and floor = 1)
SELECT "usersessions".* FROM "usersessions" WHERE (ridecount <= 5 and ridecount IS NOT NULL) AND (config = 0)
SELECT COUNT(*) FROM "rides"